#### FilterNumericGreaterOrEqual Members

---

|  |
| --- |
| FilterNumericGreaterOrEqual Class   Constructors   Methods   Properties   See Also |

The  FilterNumericGreaterOrEqual  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterNumericGreaterOrEqual | Constructs an instance of FilterNumericGreaterOrEqual. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  FilterNumericRuleEvaluator  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | Evaluate(Int32, Int32) | Derived classes should override this method to implement the desired test. (Inherited from  FilterNumericRuleEvaluator  .) |
| Public method | Evaluate(Double, Double, Double) | Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not. (Inherited from  FilterNumericRuleEvaluator  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  FilterNumericRuleEvaluator  .) |

# See Also

FilterNumericGreaterOrEqual Class

Autodesk.Revit.DB Namespace